// Задача 00 :
//Написать программу, которая принимает число и выдает его кватдрат 

//Например:
// 4 -> 16
//-3 -> 9
//-7 -> 49


Console.WriteLine("Введите целое число:  ");
int num = Convert.ToInt32 (Console.ReadLine());
Console.WriteLine(num * num);

 
